# Где взять api ID и api HASH?
# Логинимся на https://my.telegram.org/auth
# Переходим на API development tools (https://my.telegram.org/apps)
# Заполните данные как вам будет удобнее
# После чего вам станут доступны app api ID и app api HASH

# App api_id
api_id = 12345678

# App api_hash
api_hash = "a1b2c3d4e5f6g7h8i9"

# Здесь вам нужно ввести свой номер телефона.
# Это нужно т.к. этот бот работает от лица человека, а не бота. По-другому сохранение
# каналов сделать невозможно.

# Номер телефона от телеграм аккаунта
phone_number = "+79994441122"

# После первого запуска бота вам придёт в лс код авторизации, его надо будет ввести в консоль.
# Если у вас установлен облачный пароль, после кода авторизации вам надо будет ввести его в консоль.

# Что-бы удалить аккаунт, остановите бота и удалите файл ChannelArchiver.session
